grevaillot/svd_tools/headers/STM32G07x/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define TIM14_BASE			(0x40002000)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define USART4_BASE			(0x40004c00)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define PWR_BASE			(0x40007000)
#define DAC_BASE			(0x40007400)
#define HDMI_CEC_BASE			(0x40007800)
#define LPTIM1_BASE			(0x40007c00)
#define LPUART_BASE			(0x40008000)
#define LPTIM2_BASE			(0x40009400)
#define UCPD1_BASE			(0x4000a000)
#define UCPD2_BASE			(0x4000a400)
#define TAMP_BASE			(0x4000b000)
#define SYSCFG_VREFBUF_BASE			(0x40010000)
#define COMP_BASE			(0x40010200)
#define ADC_BASE			(0x40012400)
#define TIM1_BASE			(0x40012c00)
#define SPI1_BASE			(0x40013000)
#define USART1_BASE			(0x40013800)
#define TIM15_BASE			(0x40014000)
#define TIM16_BASE			(0x40014400)
#define TIM17_BASE			(0x40014800)
#define DBG_BASE			(0x40015800)
#define DMA_BASE			(0x40020000)
#define DMAMUX_BASE			(0x40020800)
#define RCC_BASE			(0x40021000)
#define EXTI_BASE			(0x40021800)
#define FLASH_BASE			(0x40022000)
#define CRC_BASE			(0x40023000)
#define RNG_BASE			(0x40025000)
#define AES_BASE			(0x40026000)
#define GPIOA_BASE			(0x50000000)
#define GPIOB_BASE			(0x50000400)
#define GPIOC_BASE			(0x50000800)
#define GPIOD_BASE			(0x50000c00)
#define GPIOF_BASE			(0x50001400)
#define STK_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define MPU_BASE			(0xe000ed90)
